{
    "nav": {
        "home": "Accueil",
        "skills": "Compétences",
        "exp": "Expériences"
    },
    "home": {
        "title": "Salut, je suis {{ name }}",
        "subtitle": "Étudiant Ingénieur Logiciel à l'",
        "about": "J’adore découvrir et apprendre de nouvelles technologies, essayant au maximum de suivre les bonnes pratiques de développement. Je suis particulièrement attiré par le développement web et me considère comme un développeur back-end ou bien full-stack."
    },
    "skills": {
        "title": "Compétences techniques",
        "languages": "Langages",
        "databases": "Bases de données",
        "unit_testing": "Tests unitaires",
        "others": "Autres"
    },
    "exp": {
        "title": "Expériences",
        "intern": "Stage chez {{ enterprise }}",
        "appartoo": {
            "dates": "juillet à décembre 2017",
            "status": "Développeur web full-stack",
            "description": "Participation au développement d’une application de mise en relation pour la recherche de colocation.\nTravail sur l’API (back-end, Symfony3), et l’UX/UI (front-end, AngularJS).\nParticipation active aux prises de décisions de l’entreprise, techniques ou non.",
            "missions": "Missions importantes",
            "chat": {
                "title": "Messagerie instantannée via WebSockets",
                "main_desc": "Mise en place d’un serveur de WebSockets pour réaliser une messagerie instantanée afin de remplacer l’ancien système passant par Firebase et éviter les duplications de données entre Firebase et la base de donnée relationnelle de l’application.",
                "list": "[\"Communication en temps réel via WebSockets avec le front-end (client) pour afficher les messages en temps réel\",\"Configuration d’un proxy inverse pour utiliser le SSL\",\"Installation en tant que supervisor pour garantir son accessibilité en toute condition et un logging de qualité\",\"Migration de plus de 130 000 conversations utilisateurs de Firebase vers mySQL\"]",
                "result": "Entre 5 et 8 secondes de temps d’execution gagné sur certaines actions clés du site (inscription, dépôt d’annonce)."
            },
            "ux": {
                "title": "Modernisation et uniformisation de l’UX",
                "main_desc": "Refonte graphique de l’affichage des annonces et des profils sur le site et éutilisation des vues crées à travers l’application pour un meilleur confort utilisateur. Optimisation de la recherche.",
                "list": "[\"Meilleure cohérence du design global et meilleur confort lors de la navigation\",\"Modernisation de l’interface pour coller aux normes actuelles du web\",\"Application des filtres de recherche au clic sans avoir besoin de cliquer sur le bouton Rechercher à plusieurs reprises\"]"
            },
            "notif": {
                "title": "Refactoring du système de notifications",
                "main_desc": "Uniformisation du système de notifications, ajout de modes de notifications supplémentaires (seulement email présent) et refactoring du code en un service \"Notification Center\".",
                "list": "[\"Ajout de notifications de bureau (push) à l’aide d’un Service Worker\",\"Prise en charge des notifications Facebook (API Graph)\", \"Envoi de SMS (API Nexmo)\", \"Création d’un service gérant l’envoi de toutes les notifications selon différents critères\"]",
                "result": "Possibilité pour les utilisateurs d’être notifiés via différents types de notifications et ainsi d’accélérer leur recherche de colocation tout en améliorant la maintenance du code."
            }
        }
    },
    "tags": {
        "engineer": "ingénieur",
        "web": "web",
        "best_practices": "bonnes pratiques",
        "dev": "développement",
        "full_stack": "full-stack",
        "back": "back-end",
        "front": "front-end",
        "nginx": "NGiNX",
        "mySQL": "mySQL",
        "angularJS": "angularJS",
        "symfony": "symfony",
        "api": "API",
        "php": "PHP",
        "js": "JavaScript"
    }
}
